#include "common.h"

void baseball_title()
{
	printf(
		"_// _//         _/         _// //  _//////// _// _//         _/       _//      _//		 \n"
		"_ /	 _//    _/ //     _//    _//_//       _/    _//      _/ //     _//      _//      \n"
		"_ /	_//    _/  _//     _//      _//       _/     _//    _/  _//    _//      _//      \n"
		"_/// _/      _//   _//      _//    _//////   _/// _/      _//   _//   _//      _//      \n"
		"_ /	_//  _////// _//        _// _//       _/     _//  _////// _//  _//      _//      \n"
		"_ /	_ / _//       _// _//    _//_//       _/      _/ _//       _// _//      _//      \n"
		"_//// _// _//         _//  _// //  _//////// _//// _// _//         _//_////////_////////\n"

	);
	printf("\n");
	printf(
		"   _////         _/       _//       _// _////////\n"
		"  _/    _//      _/ //     _/ _//   _/// _//     \n"
		"_//            _/  _//    _// _// _ _// _//      \n"
		"_//           _//   _//   _//  _//  _// _//////  \n"
		"_//   _////  _////// _//  _//   _/  _// _//      \n"
		" _//    _/  _//       _// _//       _// _//      \n"
		"  _/////   _//         _//_//       _// _////////\n"
	);
	printf("==================\n");
	printf("숫자야구\n");
	printf("1.1인_단일모드\n");
	printf("2.1인_타임어택\n");
	printf("3.2인_단일정답\n");
	printf("4.2인_개인정답\n");
	printf("5.1인 단일 스코어보드 출력\n");
	printf("6.1인 타임어택 스코어보드 출력\n");
	printf("7.크래딧\n");
	printf("8.숫자야구 종료\n");
	printf("==================\n");
	printf("원하시는 모드를 입력하세요\n:");
}

void baseball_visual_(int strike,int ball,int out)
{
	int i=0;
	printf("Strike:");
	while (i != 3)
	{
		if (strike - i > 0)
		{
			printf("●");
			i++;
		}
		else if (strike - i <= 0)
		{
			printf("○");
			i++;
		}
	}
	i = 0;
	printf("\nBall:");
	while (i != 3)
	{
		if (ball - i > 0)
		{
			printf("●");
			i++;
		}
		else if (ball - i <= 0)
		{
			printf("○");
			i++;
		}
	}
	i = 0;
	printf("\nOut:");
	while (i != 3)
	{
		if (out - i > 0)
		{
			printf("●");
			i++;
		}
		else if (out - i <= 0)
		{
			printf("○");
			i++;
		}
	}
	printf("\n");
}